###### 1.Program to test whether none of the elements of a given array is zero.

In [1]:
import numpy as np

In [2]:
arr=np.array([1,2,3,4,5])

In [3]:
print(np.all(arr))

True

In [4]:
arr2=np.array([0,1,2,3,4])

In [5]:
print(np.all(arr2))

False

###### 2.Program to test whether any of the elements of a given array is non-zero

In [6]:
arr3=np.array([0,0,0,0])

In [7]:
print(np.any(arr3))

False

In [8]:
arr4=np.array([0,0,1,0,0])

In [9]:
print(np.any(arr4))

True

###### 3.Create an element-wise comparison (greater, greater_equal, less and less_equal) of two given arrays

In [10]:
arr5=np.array([5,10])
arr6=np.array([2,12])

In [11]:
print(np.greater(arr5,arr6))

[ True False]

In [12]:
print(np.greater_equal(arr5,arr6))

[ True False]

In [13]:
print(np.less(arr5,arr6))

[False  True]

In [14]:
print(np.less_equal(arr5,arr6))

[False  True]

###### 4.Create an array with the values 1, 7, 13, 105 and determine the size of the memory occupied by the array.

In [15]:
arr7=np.array([1,2,3,4,5])

In [16]:
arr7.itemsize*arr7.size

20

###### 5.Create an array of 10 zeros,10 ones, 10 fives.

In [17]:
arr8=np.linspace(0,0,10)
arr9=np.linspace(1,1,10)
arr10=np.linspace(5,5,10)

In [18]:
arr8

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [19]:
arr9

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [20]:
arr10

array([5., 5., 5., 5., 5., 5., 5., 5., 5., 5.])

###### 6.Create an array of the integers from 30 to70.

In [21]:
arr11=np.arange(30,71)

In [22]:
arr11

array([30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46,
       47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63,
       64, 65, 66, 67, 68, 69, 70])

###### 7.Create a 3x3 identity matrix

In [23]:
arr12=np.array([[1,2,3],
               [4,5,6],
               [7,8,9]])

In [24]:
arr12

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

###### 8.Generate a random number between 0 and 1.

In [25]:
import random 
print(random.uniform(0, 1))

0.7455075848673347

###### 9.Create a 3X4 array using and iterate over it.

In [26]:
arr13=np.linspace(1,12,12)

In [27]:
arr13

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10., 11., 12.])

In [28]:
arr13.reshape(3,4)

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6.,  7.,  8.],
       [ 9., 10., 11., 12.]])

###### 10.Create an array with values ranging from 12 to 38.

In [29]:
arr14=np.linspace(12,38,10)

In [30]:
arr14

array([12.        , 14.88888889, 17.77777778, 20.66666667, 23.55555556,
       26.44444444, 29.33333333, 32.22222222, 35.11111111, 38.        ])

###### 11.Convert an array to a float type

In [31]:
arr15=np.array([1,2,3,4,5])

In [32]:
arr16 = np.asfarray(arr15)

In [33]:
arr16

array([1., 2., 3., 4., 5.])

###### 12. Convert the values of Centigrade degrees into Fahrenheit degrees Centigrade values are stored into a NumPy array.

In [34]:
F=np.array([0, 12, 45.21, 34, 99.91, 32])
print(np.round((5*F/9 - 5*32/9),2))

[-17.78 -11.11   7.34   1.11  37.73   0.  ]

###### 13.Find the indices of the maximum and minimum values along the given axis of an array.

In [35]:
arr17=np.array([5,7,3,15])

In [36]:
np.max(arr17)

15

In [37]:
np.min(arr17)

3

###### 14.Program compare two given arrays.

In [38]:
arr18 = np.array([3, 7])
arr19 = np.array([5, 9])

In [39]:
print(np.greater(arr18, arr19))
print(np.greater_equal(arr18, arr19))
print(np.less(arr18, arr19))
print(np.less_equal(arr18, arr19))

[False False]
[False False]
[ True  True]
[ True  True]

###### 15.Program to create an array of ones and an array of zeros.

In [40]:
arr20=np.linspace(0,0,10)
arr21=np.linspace(1,1,10)

In [41]:
arr20

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [42]:
arr21

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

# Pandas

##### 1.Create a dataframe using dictionaries, list of tuples, list of dictionaries

In [43]:
import pandas as pd

In [44]:
data={"Name":['Utsav','Harsh','Ranit','Sayanti'],
     "Age":[24,23,22,21],
     "Score":[79,80,81,82],
     "Town":['Diamond','Uttarpara','Saltlake','Dumdum']}

In [45]:
df=pd.DataFrame(data)

In [46]:
df.head()

      Name  Age  Score       Town
0    Utsav   24     79    Diamond
1    Harsh   23     80  Uttarpara
2    Ranit   22     81   Saltlake
3  Sayanti   21     82     Dumdum

##### 2.Create a dataframe from reading a csv file(this csv can be created by you).

In [47]:
df

      Name  Age  Score       Town
0    Utsav   24     79    Diamond
1    Harsh   23     80  Uttarpara
2    Ranit   22     81   Saltlake
3  Sayanti   21     82     Dumdum

In [48]:
df.to_csv('data.csv')

In [49]:
abc=pd.read_csv('data.csv')

In [50]:
abc

   Unnamed: 0     Name  Age  Score       Town
0           0    Utsav   24     79    Diamond
1           1    Harsh   23     80  Uttarpara
2           2    Ranit   22     81   Saltlake
3           3  Sayanti   21     82     Dumdum

In [51]:
abc.to_csv('data_false_index.csv',index=False)
abc

   Unnamed: 0     Name  Age  Score       Town
0           0    Utsav   24     79    Diamond
1           1    Harsh   23     80  Uttarpara
2           2    Ranit   22     81   Saltlake
3           3  Sayanti   21     82     Dumdum

##### 3.Create a dataframe from reading an excel file.

In [52]:
df=pd.read_csv('data.csv')
df

   Unnamed: 0     Name  Age  Score       Town
0           0    Utsav   24     79    Diamond
1           1    Harsh   23     80  Uttarpara
2           2    Ranit   22     81   Saltlake
3           3  Sayanti   21     82     Dumdum

In [53]:
df2=pd.DataFrame(data)
df2

      Name  Age  Score       Town
0    Utsav   24     79    Diamond
1    Harsh   23     80  Uttarpara
2    Ranit   22     81   Saltlake
3  Sayanti   21     82     Dumdum

##### 4.Perform a writing dataframe function in a csv.

In [54]:
df = pd.DataFrame({"Name":['Utsav','Harsh','Ranit','Sayanti'],
     "Age":[24,23,22,21],
     "Score":[79,80,81,82],
     "Town":['Diamond','Uttarpara','Saltlake','Dumdum']})
df.to_csv(index=False)
df

      Name  Age  Score       Town
0    Utsav   24     79    Diamond
1    Harsh   23     80  Uttarpara
2    Ranit   22     81   Saltlake
3  Sayanti   21     82     Dumdum

In [58]:
df.to_csv('new.csv',index=False)

##### 5.Perform a writing dataframe function in excel.

In [ ]:
df = pd.DataFrame({"Name":['Utsav','Harsh','Ranit','Sayanti'],
     "Age":[24,23,22,21],
     "Score":[79,80,81,82],
     "Town":['Diamond','Uttarpara','Saltlake','Dumdum']})
df.to_csv(index=False)
df

In [59]:
df.to_excel('new.xlsx',sheet_name="stocks")

##### Using a dataframe, set the index of the df to a column in the dataframe

In [60]:
df = pd.DataFrame({"Name":['Utsav','Harsh','Ranit','Sayanti'],
     "Age":[24,23,22,21],
     "Score":[79,80,81,82],
     "Town":['Diamond','Uttarpara','Saltlake','Dumdum']})
df.to_csv(index=False)
df

      Name  Age  Score       Town
0    Utsav   24     79    Diamond
1    Harsh   23     80  Uttarpara
2    Ranit   22     81   Saltlake
3  Sayanti   21     82     Dumdum

In [62]:
df.set_index('Name')

         Age  Score       Town
Name
Utsav     24     79    Diamond
Harsh     23     80  Uttarpara
Ranit     22     81   Saltlake
Sayanti   21     82     Dumdum

##### 7.Reset the index to the original one

In [63]:
df.reindex()

      Name  Age  Score       Town
0    Utsav   24     79    Diamond
1    Harsh   23     80  Uttarpara
2    Ranit   22     81   Saltlake
3  Sayanti   21     82     Dumdum